docs: Diagram
